grevaillot/svd_tools/headers/STM32H7B3x/tt_fdcan.h
/** @defgroup tt_fdcan_fdcan_ils FDCANILS FDCAN Interrupt Line Select Register
@{*/

/** TT_FDCAN_FDCAN_ILS_ARAL Access to Reserved Address Line **/
#define TT_FDCAN_FDCAN_ILS_ARAL		(1 << 29)
/** TT_FDCAN_FDCAN_ILS_PEDL Protocol Error in Data Phase Line **/
#define TT_FDCAN_FDCAN_ILS_PEDL		(1 << 28)
/** TT_FDCAN_FDCAN_ILS_PEAL Protocol Error in Arbitration Phase Line **/
#define TT_FDCAN_FDCAN_ILS_PEAL		(1 << 27)
/** TT_FDCAN_FDCAN_ILS_WDIL Watchdog Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_WDIL		(1 << 26)
/** TT_FDCAN_FDCAN_ILS_BOL Bus_Off Status **/
#define TT_FDCAN_FDCAN_ILS_BOL		(1 << 25)
/** TT_FDCAN_FDCAN_ILS_EWL Warning Status Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_EWL		(1 << 24)
/** TT_FDCAN_FDCAN_ILS_EPL Error Passive Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_EPL		(1 << 23)
/** TT_FDCAN_FDCAN_ILS_ELOL Error Logging Overflow Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_ELOL		(1 << 22)
/** TT_FDCAN_FDCAN_ILS_BEUL Bit Error Uncorrected Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_BEUL		(1 << 21)
/** TT_FDCAN_FDCAN_ILS_BECL Bit Error Corrected Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_BECL		(1 << 20)
/** TT_FDCAN_FDCAN_ILS_DRXL Message stored to Dedicated Rx Buffer Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_DRXL		(1 << 19)
/** TT_FDCAN_FDCAN_ILS_TOOL Timeout Occurred Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TOOL		(1 << 18)
/** TT_FDCAN_FDCAN_ILS_MRAFL Message RAM Access Failure Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_MRAFL		(1 << 17)
/** TT_FDCAN_FDCAN_ILS_TSWL Timestamp Wraparound Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TSWL		(1 << 16)
/** TT_FDCAN_FDCAN_ILS_TEFLL Tx Event FIFO Element Lost Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TEFLL		(1 << 15)
/** TT_FDCAN_FDCAN_ILS_TEFFL Tx Event FIFO Full Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TEFFL		(1 << 14)
/** TT_FDCAN_FDCAN_ILS_TEFWL Tx Event FIFO Watermark Reached Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TEFWL		(1 << 13)
/** TT_FDCAN_FDCAN_ILS_TEFNL Tx Event FIFO New Entry Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TEFNL		(1 << 12)
/** TT_FDCAN_FDCAN_ILS_TEFL Tx FIFO Empty Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TEFL		(1 << 11)
/** TT_FDCAN_FDCAN_ILS_TCFL Transmission Cancellation Finished Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TCFL		(1 << 10)
/** TT_FDCAN_FDCAN_ILS_TCL Transmission Completed Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_TCL		(1 << 9)
/** TT_FDCAN_FDCAN_ILS_HPML High Priority Message Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_HPML		(1 << 8)
/** TT_FDCAN_FDCAN_ILS_RF1LL Rx FIFO 1 Message Lost Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_RF1LL		(1 << 7)
/** TT_FDCAN_FDCAN_ILS_RF1FL Rx FIFO 1 Full Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_RF1FL		(1 << 6)
/** TT_FDCAN_FDCAN_ILS_RF1WL Rx FIFO 1 Watermark Reached Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_RF1WL		(1 << 5)
/** TT_FDCAN_FDCAN_ILS_RF1NL Rx FIFO 1 New Message Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_RF1NL		(1 << 4)
/** TT_FDCAN_FDCAN_ILS_RF0LL Rx FIFO 0 Message Lost Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_RF0LL		(1 << 3)
/** TT_FDCAN_FDCAN_ILS_RF0FL Rx FIFO 0 Full Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_RF0FL		(1 << 2)
/** TT_FDCAN_FDCAN_ILS_RF0WL Rx FIFO 0 Watermark Reached Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_RF0WL		(1 << 1)
/** TT_FDCAN_FDCAN_ILS_RF0NL Rx FIFO 0 New Message Interrupt Line **/
#define TT_FDCAN_FDCAN_ILS_RF0NL		(1 << 0)

/**@}*/

/** @defgroup tt_fdcan_fdcan_ile FDCANILE FDCAN Interrupt Line Enable Register
@{*/

/** TT_FDCAN_FDCAN_ILE_EINT1 Enable Interrupt Line 1 **/
#define TT_FDCAN_FDCAN_ILE_EINT1		(1 << 1)
/** TT_FDCAN_FDCAN_ILE_EINT0 Enable Interrupt Line 0 **/
#define TT_FDCAN_FDCAN_ILE_EINT0		(1 << 0)

/**@}*/

/** @defgroup tt_fdcan_fdcan_gfc FDCANGFC FDCAN Global Filter Configuration Register
@{*/


#define TT_FDCAN_FDCAN_GFC_ANFS_SHIFT		4
#define TT_FDCAN_FDCAN_GFC_ANFS_MASK		0x03
/** @defgroup tt_fdcan_fdcan_gfc_anfs ANFS Accept Non-matching Frames Standard
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_GFC_ANFE_SHIFT		2
#define TT_FDCAN_FDCAN_GFC_ANFE_MASK		0x03
/** @defgroup tt_fdcan_fdcan_gfc_anfe ANFE Accept Non-matching Frames Extended
@{*/
/**@}*/

/** TT_FDCAN_FDCAN_GFC_RRFS Reject Remote Frames Standard **/
#define TT_FDCAN_FDCAN_GFC_RRFS		(1 << 1)
/** TT_FDCAN_FDCAN_GFC_RRFE Reject Remote Frames Extended **/
#define TT_FDCAN_FDCAN_GFC_RRFE		(1 << 0)

/**@}*/

/** @defgroup tt_fdcan_fdcan_sidfc FDCANSIDFC FDCAN Standard ID Filter Configuration Register
@{*/


#define TT_FDCAN_FDCAN_SIDFC_LSS_SHIFT		16
#define TT_FDCAN_FDCAN_SIDFC_LSS_MASK		0xff
/** @defgroup tt_fdcan_fdcan_sidfc_lss LSS List Size Standard
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_SIDFC_FLSSA_SHIFT		2
#define TT_FDCAN_FDCAN_SIDFC_FLSSA_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_sidfc_flssa FLSSA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_xidfc FDCANXIDFC FDCAN Extended ID Filter Configuration Register
@{*/


#define TT_FDCAN_FDCAN_XIDFC_LSE_SHIFT		16
#define TT_FDCAN_FDCAN_XIDFC_LSE_MASK		0xff
/** @defgroup tt_fdcan_fdcan_xidfc_lse LSE List Size Extended
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_XIDFC_FLESA_SHIFT		2
#define TT_FDCAN_FDCAN_XIDFC_FLESA_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_xidfc_flesa FLESA Filter List Standard Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_xidam FDCANXIDAM FDCAN Extended ID and Mask Register
@{*/


#define TT_FDCAN_FDCAN_XIDAM_EIDM_SHIFT		0
#define TT_FDCAN_FDCAN_XIDAM_EIDM_MASK		0x1fffffff
/** @defgroup tt_fdcan_fdcan_xidam_eidm EIDM Extended ID Mask
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_hpms FDCANHPMS FDCAN High Priority Message Status Register
@{*/

/** TT_FDCAN_FDCAN_HPMS_FLST Filter List **/
#define TT_FDCAN_FDCAN_HPMS_FLST		(1 << 15)

#define TT_FDCAN_FDCAN_HPMS_FIDX_SHIFT		8
#define TT_FDCAN_FDCAN_HPMS_FIDX_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_hpms_fidx FIDX Filter Index
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_HPMS_MSI_SHIFT		6
#define TT_FDCAN_FDCAN_HPMS_MSI_MASK		0x03
/** @defgroup tt_fdcan_fdcan_hpms_msi MSI Message Storage Indicator
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_HPMS_BIDX_SHIFT		0
#define TT_FDCAN_FDCAN_HPMS_BIDX_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_hpms_bidx BIDX Buffer Index
@{*/
/**@}*/


/**@}*/

