grevaillot/svd_tools/headers/STM32H7B3x/tt_fdcan.h
/** @defgroup tt_fdcan_fdcan_ndat1 FDCANNDAT1 FDCAN New Data 1 Register
@{*/

/** TT_FDCAN_FDCAN_NDAT1_ND31 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND31		(1 << 31)
/** TT_FDCAN_FDCAN_NDAT1_ND30 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND30		(1 << 30)
/** TT_FDCAN_FDCAN_NDAT1_ND29 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND29		(1 << 29)
/** TT_FDCAN_FDCAN_NDAT1_ND28 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND28		(1 << 28)
/** TT_FDCAN_FDCAN_NDAT1_ND27 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND27		(1 << 27)
/** TT_FDCAN_FDCAN_NDAT1_ND26 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND26		(1 << 26)
/** TT_FDCAN_FDCAN_NDAT1_ND25 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND25		(1 << 25)
/** TT_FDCAN_FDCAN_NDAT1_ND24 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND24		(1 << 24)
/** TT_FDCAN_FDCAN_NDAT1_ND23 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND23		(1 << 23)
/** TT_FDCAN_FDCAN_NDAT1_ND22 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND22		(1 << 22)
/** TT_FDCAN_FDCAN_NDAT1_ND21 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND21		(1 << 21)
/** TT_FDCAN_FDCAN_NDAT1_ND20 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND20		(1 << 20)
/** TT_FDCAN_FDCAN_NDAT1_ND19 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND19		(1 << 19)
/** TT_FDCAN_FDCAN_NDAT1_ND18 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND18		(1 << 18)
/** TT_FDCAN_FDCAN_NDAT1_ND17 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND17		(1 << 17)
/** TT_FDCAN_FDCAN_NDAT1_ND16 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND16		(1 << 16)
/** TT_FDCAN_FDCAN_NDAT1_ND15 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND15		(1 << 15)
/** TT_FDCAN_FDCAN_NDAT1_ND14 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND14		(1 << 14)
/** TT_FDCAN_FDCAN_NDAT1_ND13 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND13		(1 << 13)
/** TT_FDCAN_FDCAN_NDAT1_ND12 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND12		(1 << 12)
/** TT_FDCAN_FDCAN_NDAT1_ND11 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND11		(1 << 11)
/** TT_FDCAN_FDCAN_NDAT1_ND10 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND10		(1 << 10)
/** TT_FDCAN_FDCAN_NDAT1_ND9 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND9		(1 << 9)
/** TT_FDCAN_FDCAN_NDAT1_ND8 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND8		(1 << 8)
/** TT_FDCAN_FDCAN_NDAT1_ND7 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND7		(1 << 7)
/** TT_FDCAN_FDCAN_NDAT1_ND6 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND6		(1 << 6)
/** TT_FDCAN_FDCAN_NDAT1_ND5 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND5		(1 << 5)
/** TT_FDCAN_FDCAN_NDAT1_ND4 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND4		(1 << 4)
/** TT_FDCAN_FDCAN_NDAT1_ND3 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND3		(1 << 3)
/** TT_FDCAN_FDCAN_NDAT1_ND2 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND2		(1 << 2)
/** TT_FDCAN_FDCAN_NDAT1_ND1 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND1		(1 << 1)
/** TT_FDCAN_FDCAN_NDAT1_ND0 New data **/
#define TT_FDCAN_FDCAN_NDAT1_ND0		(1 << 0)

/**@}*/

/** @defgroup tt_fdcan_fdcan_ndat2 FDCANNDAT2 FDCAN New Data 2 Register
@{*/

/** TT_FDCAN_FDCAN_NDAT2_ND63 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND63		(1 << 31)
/** TT_FDCAN_FDCAN_NDAT2_ND62 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND62		(1 << 30)
/** TT_FDCAN_FDCAN_NDAT2_ND61 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND61		(1 << 29)
/** TT_FDCAN_FDCAN_NDAT2_ND60 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND60		(1 << 28)
/** TT_FDCAN_FDCAN_NDAT2_ND59 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND59		(1 << 27)
/** TT_FDCAN_FDCAN_NDAT2_ND58 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND58		(1 << 26)
/** TT_FDCAN_FDCAN_NDAT2_ND57 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND57		(1 << 25)
/** TT_FDCAN_FDCAN_NDAT2_ND56 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND56		(1 << 24)
/** TT_FDCAN_FDCAN_NDAT2_ND55 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND55		(1 << 23)
/** TT_FDCAN_FDCAN_NDAT2_ND54 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND54		(1 << 22)
/** TT_FDCAN_FDCAN_NDAT2_ND53 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND53		(1 << 21)
/** TT_FDCAN_FDCAN_NDAT2_ND52 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND52		(1 << 20)
/** TT_FDCAN_FDCAN_NDAT2_ND51 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND51		(1 << 19)
/** TT_FDCAN_FDCAN_NDAT2_ND50 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND50		(1 << 18)
/** TT_FDCAN_FDCAN_NDAT2_ND49 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND49		(1 << 17)
/** TT_FDCAN_FDCAN_NDAT2_ND48 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND48		(1 << 16)
/** TT_FDCAN_FDCAN_NDAT2_ND47 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND47		(1 << 15)
/** TT_FDCAN_FDCAN_NDAT2_ND46 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND46		(1 << 14)
/** TT_FDCAN_FDCAN_NDAT2_ND45 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND45		(1 << 13)
/** TT_FDCAN_FDCAN_NDAT2_ND44 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND44		(1 << 12)
/** TT_FDCAN_FDCAN_NDAT2_ND43 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND43		(1 << 11)
/** TT_FDCAN_FDCAN_NDAT2_ND42 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND42		(1 << 10)
/** TT_FDCAN_FDCAN_NDAT2_ND41 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND41		(1 << 9)
/** TT_FDCAN_FDCAN_NDAT2_ND40 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND40		(1 << 8)
/** TT_FDCAN_FDCAN_NDAT2_ND39 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND39		(1 << 7)
/** TT_FDCAN_FDCAN_NDAT2_ND38 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND38		(1 << 6)
/** TT_FDCAN_FDCAN_NDAT2_ND37 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND37		(1 << 5)
/** TT_FDCAN_FDCAN_NDAT2_ND36 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND36		(1 << 4)
/** TT_FDCAN_FDCAN_NDAT2_ND35 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND35		(1 << 3)
/** TT_FDCAN_FDCAN_NDAT2_ND34 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND34		(1 << 2)
/** TT_FDCAN_FDCAN_NDAT2_ND33 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND33		(1 << 1)
/** TT_FDCAN_FDCAN_NDAT2_ND32 New data **/
#define TT_FDCAN_FDCAN_NDAT2_ND32		(1 << 0)

/**@}*/

/** @defgroup tt_fdcan_fdcan_rxf0c FDCANRXF0C FDCAN Rx FIFO 0 Configuration Register
@{*/


#define TT_FDCAN_FDCAN_RXF0C_F0WM_SHIFT		24
#define TT_FDCAN_FDCAN_RXF0C_F0WM_MASK		0xff
/** @defgroup tt_fdcan_fdcan_rxf0c_f0wm F0WM FIFO 0 Watermark
@{*/
/**@}*/


