grevaillot/svd_tools/headers/STM32H7B3x/tt_fdcan.h
#define TT_FDCAN_FDCAN_RXF0C_F0S_SHIFT		16
#define TT_FDCAN_FDCAN_RXF0C_F0S_MASK		0xff
/** @defgroup tt_fdcan_fdcan_rxf0c_f0s F0S Rx FIFO 0 Size
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXF0C_F0SA_SHIFT		2
#define TT_FDCAN_FDCAN_RXF0C_F0SA_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_rxf0c_f0sa F0SA Rx FIFO 0 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_rxf0s FDCANRXF0S FDCAN Rx FIFO 0 Status Register
@{*/

/** TT_FDCAN_FDCAN_RXF0S_RF0L Rx FIFO 0 Message Lost **/
#define TT_FDCAN_FDCAN_RXF0S_RF0L		(1 << 25)
/** TT_FDCAN_FDCAN_RXF0S_F0F Rx FIFO 0 Full **/
#define TT_FDCAN_FDCAN_RXF0S_F0F		(1 << 24)

#define TT_FDCAN_FDCAN_RXF0S_F0P_SHIFT		16
#define TT_FDCAN_FDCAN_RXF0S_F0P_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_rxf0s_f0p F0P Rx FIFO 0 Put Index
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXF0S_F0G_SHIFT		8
#define TT_FDCAN_FDCAN_RXF0S_F0G_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_rxf0s_f0g F0G Rx FIFO 0 Get Index
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXF0S_F0FL_SHIFT		0
#define TT_FDCAN_FDCAN_RXF0S_F0FL_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_rxf0s_f0fl F0FL Rx FIFO 0 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_rxf0a FDCANRXF0A CAN Rx FIFO 0 Acknowledge Register
@{*/


#define TT_FDCAN_FDCAN_RXF0A_FA01_SHIFT		0
#define TT_FDCAN_FDCAN_RXF0A_FA01_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_rxf0a_fa01 FA01 Rx FIFO 0 Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_rxbc FDCANRXBC FDCAN Rx Buffer Configuration Register
@{*/


#define TT_FDCAN_FDCAN_RXBC_RBSA_SHIFT		2
#define TT_FDCAN_FDCAN_RXBC_RBSA_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_rxbc_rbsa RBSA Rx Buffer Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_rxf1c FDCANRXF1C FDCAN Rx FIFO 1 Configuration Register
@{*/


#define TT_FDCAN_FDCAN_RXF1C_F1WM_SHIFT		24
#define TT_FDCAN_FDCAN_RXF1C_F1WM_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_rxf1c_f1wm F1WM Rx FIFO 1 Watermark
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXF1C_F1S_SHIFT		16
#define TT_FDCAN_FDCAN_RXF1C_F1S_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_rxf1c_f1s F1S Rx FIFO 1 Size
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXF1C_F1SA_SHIFT		2
#define TT_FDCAN_FDCAN_RXF1C_F1SA_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_rxf1c_f1sa F1SA Rx FIFO 1 Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_rxf1s FDCANRXF1S FDCAN Rx FIFO 1 Status Register
@{*/


#define TT_FDCAN_FDCAN_RXF1S_DMS_SHIFT		30
#define TT_FDCAN_FDCAN_RXF1S_DMS_MASK		0x03
/** @defgroup tt_fdcan_fdcan_rxf1s_dms DMS Debug Message Status
@{*/
/**@}*/

/** TT_FDCAN_FDCAN_RXF1S_RF1L Rx FIFO 1 Message Lost **/
#define TT_FDCAN_FDCAN_RXF1S_RF1L		(1 << 25)
/** TT_FDCAN_FDCAN_RXF1S_F1F Rx FIFO 1 Full **/
#define TT_FDCAN_FDCAN_RXF1S_F1F		(1 << 24)

#define TT_FDCAN_FDCAN_RXF1S_F1PI_SHIFT		16
#define TT_FDCAN_FDCAN_RXF1S_F1PI_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_rxf1s_f1pi F1PI Rx FIFO 1 Put Index
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXF1S_F1GI_SHIFT		8
#define TT_FDCAN_FDCAN_RXF1S_F1GI_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_rxf1s_f1gi F1GI Rx FIFO 1 Get Index
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXF1S_F1FL_SHIFT		0
#define TT_FDCAN_FDCAN_RXF1S_F1FL_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_rxf1s_f1fl F1FL Rx FIFO 1 Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_rxf1a FDCANRXF1A FDCAN Rx FIFO 1 Acknowledge Register
@{*/


#define TT_FDCAN_FDCAN_RXF1A_F1AI_SHIFT		0
#define TT_FDCAN_FDCAN_RXF1A_F1AI_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_rxf1a_f1ai F1AI Rx FIFO 1 Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_rxesc FDCANRXESC FDCAN Rx Buffer Element Size Configuration Register
@{*/


#define TT_FDCAN_FDCAN_RXESC_RBDS_SHIFT		8
#define TT_FDCAN_FDCAN_RXESC_RBDS_MASK		0x07
/** @defgroup tt_fdcan_fdcan_rxesc_rbds RBDS Rx Buffer Data Field Size:
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXESC_F1DS_SHIFT		4
#define TT_FDCAN_FDCAN_RXESC_F1DS_MASK		0x07
/** @defgroup tt_fdcan_fdcan_rxesc_f1ds F1DS Rx FIFO 0 Data Field Size:
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_RXESC_F0DS_SHIFT		0
#define TT_FDCAN_FDCAN_RXESC_F0DS_MASK		0x07
/** @defgroup tt_fdcan_fdcan_rxesc_f0ds F0DS Rx FIFO 1 Data Field Size:
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txbc FDCANTXBC FDCAN Tx Buffer Configuration Register
@{*/

/** TT_FDCAN_FDCAN_TXBC_TFQM Tx FIFO/Queue Mode **/
#define TT_FDCAN_FDCAN_TXBC_TFQM		(1 << 30)

#define TT_FDCAN_FDCAN_TXBC_TFQS_SHIFT		24
#define TT_FDCAN_FDCAN_TXBC_TFQS_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_txbc_tfqs TFQS Transmit FIFO/Queue Size
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TXBC_NDTB_SHIFT		16
#define TT_FDCAN_FDCAN_TXBC_NDTB_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_txbc_ndtb NDTB Number of Dedicated Transmit Buffers
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TXBC_TBSA_SHIFT		2
#define TT_FDCAN_FDCAN_TXBC_TBSA_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_txbc_tbsa TBSA Tx Buffers Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txfqs FDCANTXFQS FDCAN Tx FIFO/Queue Status Register
@{*/

/** TT_FDCAN_FDCAN_TXFQS_TFQF Tx FIFO/Queue Full **/
#define TT_FDCAN_FDCAN_TXFQS_TFQF		(1 << 21)

#define TT_FDCAN_FDCAN_TXFQS_TFQPI_SHIFT		16
#define TT_FDCAN_FDCAN_TXFQS_TFQPI_MASK		0x1f
/** @defgroup tt_fdcan_fdcan_txfqs_tfqpi TFQPI Tx FIFO/Queue Put Index
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TXFQS_TFGI_SHIFT		8
#define TT_FDCAN_FDCAN_TXFQS_TFGI_MASK		0x1f
/** @defgroup tt_fdcan_fdcan_txfqs_tfgi TFGI TFGI
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TXFQS_TFFL_SHIFT		0
#define TT_FDCAN_FDCAN_TXFQS_TFFL_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_txfqs_tffl TFFL Tx FIFO Free Level
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txesc FDCANTXESC FDCAN Tx Buffer Element Size Configuration Register
@{*/


#define TT_FDCAN_FDCAN_TXESC_TBDS_SHIFT		0
#define TT_FDCAN_FDCAN_TXESC_TBDS_MASK		0x07
/** @defgroup tt_fdcan_fdcan_txesc_tbds TBDS Tx Buffer Data Field Size:
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txbrp FDCANTXBRP FDCAN Tx Buffer Request Pending Register
@{*/


#define TT_FDCAN_FDCAN_TXBRP_TRP_SHIFT		0
#define TT_FDCAN_FDCAN_TXBRP_TRP_MASK		0xffffffff
/** @defgroup tt_fdcan_fdcan_txbrp_trp TRP Transmission Request Pending
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txbar FDCANTXBAR FDCAN Tx Buffer Add Request Register
@{*/


#define TT_FDCAN_FDCAN_TXBAR_AR_SHIFT		0
#define TT_FDCAN_FDCAN_TXBAR_AR_MASK		0xffffffff
/** @defgroup tt_fdcan_fdcan_txbar_ar AR Add Request
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txbcr FDCANTXBCR FDCAN Tx Buffer Cancellation Request Register
@{*/


#define TT_FDCAN_FDCAN_TXBCR_CR_SHIFT		0
#define TT_FDCAN_FDCAN_TXBCR_CR_MASK		0xffffffff
/** @defgroup tt_fdcan_fdcan_txbcr_cr CR Cancellation Request
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txbto FDCANTXBTO FDCAN Tx Buffer Transmission Occurred Register
@{*/


#define TT_FDCAN_FDCAN_TXBTO_TO_SHIFT		0
#define TT_FDCAN_FDCAN_TXBTO_TO_MASK		0xffffffff
/** @defgroup tt_fdcan_fdcan_txbto_to TO Transmission Occurred.
@{*/
/**@}*/


/**@}*/

