grevaillot/svd_tools/headers/STM32H7B3x/tt_fdcan.h
/** @defgroup tt_fdcan_fdcan_txbcf FDCANTXBCF FDCAN Tx Buffer Cancellation Finished Register
@{*/


#define TT_FDCAN_FDCAN_TXBCF_CF_SHIFT		0
#define TT_FDCAN_FDCAN_TXBCF_CF_MASK		0xffffffff
/** @defgroup tt_fdcan_fdcan_txbcf_cf CF Cancellation Finished
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txbtie FDCANTXBTIE FDCAN Tx Buffer Transmission Interrupt Enable Register
@{*/


#define TT_FDCAN_FDCAN_TXBTIE_TIE_SHIFT		0
#define TT_FDCAN_FDCAN_TXBTIE_TIE_MASK		0xffffffff
/** @defgroup tt_fdcan_fdcan_txbtie_tie TIE Transmission Interrupt Enable
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txbcie FDCANTXBCIE FDCAN Tx Buffer Cancellation Finished Interrupt Enable Register
@{*/


#define TT_FDCAN_FDCAN_TXBCIE_CF_SHIFT		0
#define TT_FDCAN_FDCAN_TXBCIE_CF_MASK		0xffffffff
/** @defgroup tt_fdcan_fdcan_txbcie_cf CF Cancellation Finished Interrupt Enable
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txefc FDCANTXEFC FDCAN Tx Event FIFO Configuration Register
@{*/


#define TT_FDCAN_FDCAN_TXEFC_EFWM_SHIFT		24
#define TT_FDCAN_FDCAN_TXEFC_EFWM_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_txefc_efwm EFWM Event FIFO Watermark
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TXEFC_EFS_SHIFT		16
#define TT_FDCAN_FDCAN_TXEFC_EFS_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_txefc_efs EFS Event FIFO Size
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TXEFC_EFSA_SHIFT		2
#define TT_FDCAN_FDCAN_TXEFC_EFSA_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_txefc_efsa EFSA Event FIFO Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txefs FDCANTXEFS FDCAN Tx Event FIFO Status Register
@{*/

/** TT_FDCAN_FDCAN_TXEFS_TEFL Tx Event FIFO Element Lost. **/
#define TT_FDCAN_FDCAN_TXEFS_TEFL		(1 << 25)
/** TT_FDCAN_FDCAN_TXEFS_EFF Event FIFO Full. **/
#define TT_FDCAN_FDCAN_TXEFS_EFF		(1 << 24)

#define TT_FDCAN_FDCAN_TXEFS_EFGI_SHIFT		8
#define TT_FDCAN_FDCAN_TXEFS_EFGI_MASK		0x1f
/** @defgroup tt_fdcan_fdcan_txefs_efgi EFGI Event FIFO Get Index.
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TXEFS_EFFL_SHIFT		0
#define TT_FDCAN_FDCAN_TXEFS_EFFL_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_txefs_effl EFFL Event FIFO Fill Level
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_txefa FDCANTXEFA FDCAN Tx Event FIFO Acknowledge Register
@{*/


#define TT_FDCAN_FDCAN_TXEFA_EFAI_SHIFT		0
#define TT_FDCAN_FDCAN_TXEFA_EFAI_MASK		0x1f
/** @defgroup tt_fdcan_fdcan_txefa_efai EFAI Event FIFO Acknowledge Index
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_tttmc FDCANTTTMC FDCAN TT Trigger Memory Configuration Register
@{*/


#define TT_FDCAN_FDCAN_TTTMC_TME_SHIFT		16
#define TT_FDCAN_FDCAN_TTTMC_TME_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_tttmc_tme TME Trigger Memory Elements
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTTMC_TMSA_SHIFT		2
#define TT_FDCAN_FDCAN_TTTMC_TMSA_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_tttmc_tmsa TMSA Trigger Memory Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttts FDCANTTTS FDCAN TT Trigger Select Register
@{*/


#define TT_FDCAN_FDCAN_TTTS_EVTSEL_SHIFT		4
#define TT_FDCAN_FDCAN_TTTS_EVTSEL_MASK		0x03
/** @defgroup tt_fdcan_fdcan_ttts_evtsel EVTSEL Event trigger input selection
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTTS_SWTDEL_SHIFT		0
#define TT_FDCAN_FDCAN_TTTS_SWTDEL_MASK		0x03
/** @defgroup tt_fdcan_fdcan_ttts_swtdel SWTDEL Stop watch trigger input selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttrmc FDCANTTRMC FDCAN TT Reference Message Configuration Register
@{*/

/** TT_FDCAN_FDCAN_TTRMC_RMPS Reference Message Payload Select **/
#define TT_FDCAN_FDCAN_TTRMC_RMPS		(1 << 31)
/** TT_FDCAN_FDCAN_TTRMC_XTD Extended Identifier **/
#define TT_FDCAN_FDCAN_TTRMC_XTD		(1 << 30)

#define TT_FDCAN_FDCAN_TTRMC_RID_SHIFT		0
#define TT_FDCAN_FDCAN_TTRMC_RID_MASK		0x1fffffff
/** @defgroup tt_fdcan_fdcan_ttrmc_rid RID Reference Identifier.
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttocf FDCANTTOCF FDCAN TT Operation Configuration Register
@{*/

/** TT_FDCAN_FDCAN_TTOCF_EVTP Event Trigger Polarity **/
#define TT_FDCAN_FDCAN_TTOCF_EVTP		(1 << 26)
/** TT_FDCAN_FDCAN_TTOCF_ECC Enable Clock Calibration **/
#define TT_FDCAN_FDCAN_TTOCF_ECC		(1 << 25)
/** TT_FDCAN_FDCAN_TTOCF_EGTF Enable Global Time Filtering **/
#define TT_FDCAN_FDCAN_TTOCF_EGTF		(1 << 24)

#define TT_FDCAN_FDCAN_TTOCF_AWL_SHIFT		16
#define TT_FDCAN_FDCAN_TTOCF_AWL_MASK		0xff
/** @defgroup tt_fdcan_fdcan_ttocf_awl AWL Application Watchdog Limit
@{*/
/**@}*/

/** TT_FDCAN_FDCAN_TTOCF_EECS Enable External Clock Synchronization **/
#define TT_FDCAN_FDCAN_TTOCF_EECS		(1 << 15)

#define TT_FDCAN_FDCAN_TTOCF_IRTO_SHIFT		8
#define TT_FDCAN_FDCAN_TTOCF_IRTO_MASK		0x7f
/** @defgroup tt_fdcan_fdcan_ttocf_irto IRTO Initial Reference Trigger Offset
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTOCF_LDSDL_SHIFT		5
#define TT_FDCAN_FDCAN_TTOCF_LDSDL_MASK		0x07
/** @defgroup tt_fdcan_fdcan_ttocf_ldsdl LDSDL LD of Synchronization Deviation Limit
@{*/
/**@}*/

/** TT_FDCAN_FDCAN_TTOCF_TM Time Master **/
#define TT_FDCAN_FDCAN_TTOCF_TM		(1 << 4)
/** TT_FDCAN_FDCAN_TTOCF_GEN Gap Enable **/
#define TT_FDCAN_FDCAN_TTOCF_GEN		(1 << 3)

#define TT_FDCAN_FDCAN_TTOCF_OM_SHIFT		0
#define TT_FDCAN_FDCAN_TTOCF_OM_MASK		0x03
/** @defgroup tt_fdcan_fdcan_ttocf_om OM Operation Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttmlm FDCANTTMLM FDCAN TT Matrix Limits Register
@{*/


#define TT_FDCAN_FDCAN_TTMLM_ENTT_SHIFT		16
#define TT_FDCAN_FDCAN_TTMLM_ENTT_MASK		0xfff
/** @defgroup tt_fdcan_fdcan_ttmlm_entt ENTT Expected Number of Tx Triggers
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTMLM_TXEW_SHIFT		8
#define TT_FDCAN_FDCAN_TTMLM_TXEW_MASK		0x0f
/** @defgroup tt_fdcan_fdcan_ttmlm_txew TXEW Tx Enable Window
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTMLM_CSS_SHIFT		6
#define TT_FDCAN_FDCAN_TTMLM_CSS_MASK		0x03
/** @defgroup tt_fdcan_fdcan_ttmlm_css CSS Cycle Start Synchronization
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTMLM_CCM_SHIFT		0
#define TT_FDCAN_FDCAN_TTMLM_CCM_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_ttmlm_ccm CCM Cycle Count Max
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_turcf FDCANTURCF FDCAN TUR Configuration Register
@{*/

/** TT_FDCAN_FDCAN_TURCF_ELT Enable Local Time **/
#define TT_FDCAN_FDCAN_TURCF_ELT		(1 << 31)

#define TT_FDCAN_FDCAN_TURCF_DC_SHIFT		16
#define TT_FDCAN_FDCAN_TURCF_DC_MASK		0x3fff
/** @defgroup tt_fdcan_fdcan_turcf_dc DC Denominator Configuration.
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TURCF_NCL_SHIFT		0
#define TT_FDCAN_FDCAN_TURCF_NCL_MASK		0xffff
/** @defgroup tt_fdcan_fdcan_turcf_ncl NCL Numerator Configuration Low.
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttocn FDCANTTOCN FDCAN TT Operation Control Register
@{*/

/** TT_FDCAN_FDCAN_TTOCN_LCKC TT Operation Control Register Locked **/
#define TT_FDCAN_FDCAN_TTOCN_LCKC		(1 << 15)
/** TT_FDCAN_FDCAN_TTOCN_ESCN External Synchronization Control **/
#define TT_FDCAN_FDCAN_TTOCN_ESCN		(1 << 13)
/** TT_FDCAN_FDCAN_TTOCN_NIG Next is Gap **/
#define TT_FDCAN_FDCAN_TTOCN_NIG		(1 << 12)
/** TT_FDCAN_FDCAN_TTOCN_TMG Time Mark Gap **/
#define TT_FDCAN_FDCAN_TTOCN_TMG		(1 << 11)
/** TT_FDCAN_FDCAN_TTOCN_FGP Finish Gap. **/
#define TT_FDCAN_FDCAN_TTOCN_FGP		(1 << 10)
/** TT_FDCAN_FDCAN_TTOCN_GCS Gap Control Select **/
#define TT_FDCAN_FDCAN_TTOCN_GCS		(1 << 9)
/** TT_FDCAN_FDCAN_TTOCN_TTIE Trigger Time Mark Interrupt Pulse Enable **/
#define TT_FDCAN_FDCAN_TTOCN_TTIE		(1 << 8)

#define TT_FDCAN_FDCAN_TTOCN_TMC_SHIFT		6
#define TT_FDCAN_FDCAN_TTOCN_TMC_MASK		0x03
/** @defgroup tt_fdcan_fdcan_ttocn_tmc TMC Register Time Mark Compare
@{*/
/**@}*/

/** TT_FDCAN_FDCAN_TTOCN_RTIE Register Time Mark Interrupt Pulse Enable **/
#define TT_FDCAN_FDCAN_TTOCN_RTIE		(1 << 5)

