grevaillot/svd_tools/headers/STM32H7B3x/tt_fdcan.h
/** @defgroup tt_fdcan_fdcan_ttost FDCANTTOST FDCAN TT Operation Status Register
@{*/

/** TT_FDCAN_FDCAN_TTOST_SPL Schedule Phase Lock **/
#define TT_FDCAN_FDCAN_TTOST_SPL		(1 << 31)
/** TT_FDCAN_FDCAN_TTOST_WECS Wait for External Clock Synchronization **/
#define TT_FDCAN_FDCAN_TTOST_WECS		(1 << 30)
/** TT_FDCAN_FDCAN_TTOST_AWE Application Watchdog Event **/
#define TT_FDCAN_FDCAN_TTOST_AWE		(1 << 29)
/** TT_FDCAN_FDCAN_TTOST_WFE Wait for Event **/
#define TT_FDCAN_FDCAN_TTOST_WFE		(1 << 28)
/** TT_FDCAN_FDCAN_TTOST_GSI Gap Started Indicator. **/
#define TT_FDCAN_FDCAN_TTOST_GSI		(1 << 27)

#define TT_FDCAN_FDCAN_TTOST_TMP_SHIFT		24
#define TT_FDCAN_FDCAN_TTOST_TMP_MASK		0x07
/** @defgroup tt_fdcan_fdcan_ttost_tmp TMP Time Master Priority
@{*/
/**@}*/

/** TT_FDCAN_FDCAN_TTOST_GFI Gap Finished Indicator. **/
#define TT_FDCAN_FDCAN_TTOST_GFI		(1 << 23)
/** TT_FDCAN_FDCAN_TTOST_WGTD Wait for Global Time Discontinuity **/
#define TT_FDCAN_FDCAN_TTOST_WGTD		(1 << 22)

#define TT_FDCAN_FDCAN_TTOST_RTO_SHIFT		8
#define TT_FDCAN_FDCAN_TTOST_RTO_MASK		0xff
/** @defgroup tt_fdcan_fdcan_ttost_rto RTO Reference Trigger Offset
@{*/
/**@}*/

/** TT_FDCAN_FDCAN_TTOST_QCS Quality of Clock Speed **/
#define TT_FDCAN_FDCAN_TTOST_QCS		(1 << 7)
/** TT_FDCAN_FDCAN_TTOST_GTP Quality of Global Time Phase **/
#define TT_FDCAN_FDCAN_TTOST_GTP		(1 << 6)

#define TT_FDCAN_FDCAN_TTOST_SYS_SHIFT		4
#define TT_FDCAN_FDCAN_TTOST_SYS_MASK		0x03
/** @defgroup tt_fdcan_fdcan_ttost_sys SYS Synchronization State
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTOST_MS_SHIFT		2
#define TT_FDCAN_FDCAN_TTOST_MS_MASK		0x03
/** @defgroup tt_fdcan_fdcan_ttost_ms MS Master State.
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTOST_EL_SHIFT		0
#define TT_FDCAN_FDCAN_TTOST_EL_MASK		0x03
/** @defgroup tt_fdcan_fdcan_ttost_el EL Error Level
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_turna FDCANTURNA FDCAN TUR Numerator Actual Register
@{*/


#define TT_FDCAN_FDCAN_TURNA_NAV_SHIFT		0
#define TT_FDCAN_FDCAN_TURNA_NAV_MASK		0x3ffff
/** @defgroup tt_fdcan_fdcan_turna_nav NAV Numerator Actual Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttlgt FDCANTTLGT FDCAN TT Local and Global Time Register
@{*/


#define TT_FDCAN_FDCAN_TTLGT_GT_SHIFT		16
#define TT_FDCAN_FDCAN_TTLGT_GT_MASK		0xffff
/** @defgroup tt_fdcan_fdcan_ttlgt_gt GT Global Time
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTLGT_LT_SHIFT		0
#define TT_FDCAN_FDCAN_TTLGT_LT_MASK		0xffff
/** @defgroup tt_fdcan_fdcan_ttlgt_lt LT Local Time
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttctc FDCANTTCTC FDCAN TT Cycle Time and Count Register
@{*/


#define TT_FDCAN_FDCAN_TTCTC_CC_SHIFT		16
#define TT_FDCAN_FDCAN_TTCTC_CC_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_ttctc_cc CC Cycle Count
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTCTC_CT_SHIFT		0
#define TT_FDCAN_FDCAN_TTCTC_CT_MASK		0xffff
/** @defgroup tt_fdcan_fdcan_ttctc_ct CT Cycle Time
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttcpt FDCANTTCPT FDCAN TT Capture Time Register
@{*/


#define TT_FDCAN_FDCAN_TTCPT_SWV_SHIFT		16
#define TT_FDCAN_FDCAN_TTCPT_SWV_MASK		0xffff
/** @defgroup tt_fdcan_fdcan_ttcpt_swv SWV Stop Watch Value
@{*/
/**@}*/


#define TT_FDCAN_FDCAN_TTCPT_CT_SHIFT		0
#define TT_FDCAN_FDCAN_TTCPT_CT_MASK		0x3f
/** @defgroup tt_fdcan_fdcan_ttcpt_ct CT Cycle Count Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tt_fdcan_fdcan_ttcsm FDCANTTCSM FDCAN TT Cycle Sync Mark Register
@{*/


#define TT_FDCAN_FDCAN_TTCSM_CSM_SHIFT		0
#define TT_FDCAN_FDCAN_TTCSM_CSM_MASK		0xffff
/** @defgroup tt_fdcan_fdcan_ttcsm_csm CSM Cycle Sync Mark
@{*/
/**@}*/


/**@}*/
